Расширение/InformationRegisters/РКЦ_РеакцииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РКЦ_РеакцииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Реакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РКЦ_Реакции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширение/CommonModules/РКЦ_ОбщегоНазначения/Ext/Module.bsl
Процедура ПриПолученииДанныхНаСервере() Экспорт
	
	Х = "ВЫБРАТЬ
	    |	РКЦ_РеакцииОбъектов.Объект КАК Объект,
	    |	РКЦ_РеакцииОбъектов.Реакция КАК Реакция
	    |ИЗ
	    |	РегистрСведений.РКЦ_РеакцииОбъектов КАК РКЦ_РеакцииОбъектов
	    |ГДЕ
	    |	РКЦ_РеакцииОбъектов.Объект В(&Объекты)
	    |ИТОГИ
	    |	КОЛИЧЕСТВО(Реакция)
	    |ПО
	    |	Объект";
	
КонецПроцедуры
